# ContainsKey Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternTable..::..ContainsKey Method
ExportPatternTable Class See Also
---
Checks whether a pattern key exists in the table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ContainsKey(
	ExportPatternKey exportpatternKey
)
```

Visual Basic
---
```text
Public Function ContainsKey ( _
	exportpatternKey As ExportPatternKey _
) As Boolean
```

Visual C++
---
```text
public:
bool ContainsKey(
	ExportPatternKey^ exportpatternKey
)
```

# ### Parameters
exportpatternKey
    Type: Autodesk.Revit.DB..::..ExportPatternKey The export pattern Key.
# ### Return Value
True if the pattern key exists in the table.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace